
&НаКлиенте
Процедура ПутьКДаннымНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла  = "";
	//Фильтр = "Excel(*.xlsx)|*.xls";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок   = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		фПуть = ДиалогОткрытияФайла.ПолноеИмяФайла;
		Объект.ПутькДанным = фПуть;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ПутькДанным);
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);	
	ЗагрузитьНаСервере(АдресВременногоХранилища);
	//ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресВременногоХранилища)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ВременныйФайл);
	
	ТабличныйДок.Прочитать(ВременныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить1(Команда)
	СоответствиеКолонок = новый Соответствие;
	НомерСтолбца = 1;
	Пока НомерСтолбца < 100 Цикл
		Если ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "ФИО" Тогда
			СоответствиеКолонок.Вставить("ФИО",НомерСтолбца);	
		ИначеЕсли ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "GUID TRM SE Project" Тогда
			СоответствиеКолонок.Вставить("ИдентификаторПроекта",НомерСтолбца);	
		ИначеЕсли ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "Месяц" Тогда 
			СоответствиеКолонок.Вставить("Период",НомерСтолбца);	
		ИначеЕсли ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "% распределения часов" Тогда
			СоответствиеКолонок.Вставить("ПроцентРаспределения",НомерСтолбца);
		ИначеЕсли ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "TRM SE Project" Тогда 
			СоответствиеКолонок.Вставить("Проект",НомерСтолбца);
		ИначеЕсли ТабличныйДок.Область("R1C" + НомерСтолбца).Текст = "Тип выставления счетов" Тогда 
			СоответствиеКолонок.Вставить("ТипВыставленияСчета",НомерСтолбца);
		КонецЕсли;
		НомерСтолбца = НомерСтолбца + 1; 
	КонецЦикла;
	
	НомерСтр = 2; 
	Пока НомерСтр <> 100 Цикл
		
		Если ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("ФИО")).Текст = "" Тогда 
			НомерСтр = 100;
		Иначе 
			стр = Объект.ТШ.Добавить();
			Объект.ТШ[НомерСтр-2].ФИО 					= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("ФИО")).Текст;
			Объект.ТШ[НомерСтр-2].Период 				= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("Период")).Текст;
			Объект.ТШ[НомерСтр-2].Проект 				= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("Проект")).Текст;
			Объект.ТШ[НомерСтр-2].ИдентификаторПроекта 	= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("ИдентификаторПроекта")).Текст;
			Объект.ТШ[НомерСтр-2].ТипВыставленияСчета 	= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("ТипВыставленияСчета")).Текст;
			Объект.ТШ[НомерСтр-2].ПроцентРаспределения 	= ТабличныйДок.Область("R" + Строка(НомерСтр) + "C" + СоответствиеКолонок.Получить("ПроцентРаспределения")).Текст; 
			НомерСтр = НомерСтр + 1; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоответствие(Команда)
	ЗаполнитьСоответствиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоответствиеНаСервере()
	СписокСотрудников = ПолучитьСписокСотрудников();	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка КАК Ссылка,
	               |	МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	               |	ХозрасчетныйОборотыДтКт.СуммаОборот КАК СуммаОборот
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&КонецПериода, ) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, , , , счеткт = &счет0201, &ОсновныеСредства, ) КАК ХозрасчетныйОборотыДтКт
	               |			ПО МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство = ХозрасчетныйОборотыДтКт.СубконтоКт1
	               |		ПО (МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ = ФизическиеЛица.Ссылка)
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка В(&Сотрудники)";
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("счет0201", ПланыСчетов.Хозрасчетный.НайтиПоКоду("02.01"));
	Запрос.УстановитьПараметр("ОсновныеСредства", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("Сотрудники", СписокСотрудников);

КонецПроцедуры

Функция ПолучитьСписокСотрудников()	
	СписокСотрудников = Новый Массив;
	Для Каждого стр Из Объект.ТШ Цикл
		СписокСотрудников.Добавить(стр.ФИО);	
	КонецЦикла;
	Возврат СписокСотрудников;
КонецФункции
